Repository: common-repository/pgp-key-generator
Catalog: i18n/pgp-key-generator-*.po
Languages: de_de, fr_fr

source: Generate PGP Keys
de_de: Erzeuge PGP Schlüssel
fr_fr: Générer des clés PGP

source: Your name:
de_de: Ihr Name:
fr_fr: Votre nom :

source: Your e-mail address:
de_de: Ihre E-Mail-Adresse:
fr_fr: Votre adresse e-mail :

source: required
de_de: notwendig
fr_fr: requis

source: Choose a password:
de_de: Wähle ein Passwort:
fr_fr: Choisissez un mot de passe :

source: Need help to choose a password?
de_de: Brauchen Sie Hilfe bei der Wahl eines Passworts?
fr_fr: Besoin d'aide pour choisir un mot de passe ?

source: Try a nice password generator.
de_de: Probiere diesen schönen Passwort-Generator.
fr_fr: Essayez un bon générateur de mot de passe.

source: Key Size:
de_de: Schlüssellänge:
fr_fr: Taille de la clé :

source: 1024 bits - for testing purpose only
de_de: 1024 Bit - nur für Testzwecke
fr_fr: 1024 bits - uniquement pour des tests

source: 2048 bits - recommended
de_de: 2048 Bit - Empfohlen
fr_fr: 2048 bits - recommandé

source: 4096 bits - more secure
de_de: 4096 Bit - mehr Sicherheit
fr_fr: 4096 bits - très sécurisé

source: Your browser may not respond during key generation.
de_de: Es kann vorkommen, dass Ihr Browser während der Schlüsselerzeugung nicht reagiert.
fr_fr: Votre navigateur peut ne pas répondre durant la génération des clés.

source: Public Key
de_de: Öffentlicher Schlüssel
fr_fr: Clé publique

source: Private Key
de_de: Privater Schlüssel
fr_fr: Clé privée

source: Encrypt a Message
de_de: Verschlüssel eine Nachricht
fr_fr: Crypter un message

source: Your message:
de_de: Ihre Nachricht:
fr_fr: Votre message :

source: Here is my secret message
de_de: Hier ist meine verschlüsselte Nachricht
fr_fr: Voici mon message secret

source: Encrypt
de_de: Verschlüsseln
fr_fr: Crypter

source: The public key to encrypt to:
de_de: Der öffentliche Schlüssel zum Verschlüsseln an:
fr_fr: La clé publique à utiliser pour le cryptage :

source: Decrypt a Message
de_de: Entschlüssel eine Nachricht
fr_fr: Décrypter un message

source: Your password:
de_de: Ihr Passwort:
fr_fr: Votre mot de passe :

source: Your encrypted message:
de_de: Ihre verschlüsselte Nachricht:
fr_fr: Votre message crypté :

source: Your private key:
de_de: Privater Schlüssel:
fr_fr: Votre clé privée :
